{"chunk_info": {"chunk_id": "chunk_0", "chunk_text": "Back to blog KPIs for ecommerce: Maximizing funnel performance ANALYTICS USE CASES Written by Aleksandra Szczepańska Published March 06, 2024 Regularly assessing your key performance indicators (KPI) is essential for meeting profit targets, remaining competitive, and growing your business. But which KPIs should be prioritized when measuring your ecommerce success? It all depends on your marketing funnel. The more customized your KPIs are to your marketing funnel, the more measurable and impactful they will be. Live webinar: Turn data into action with a FREE Customer Data Platform Product Solutions Resources Blog Pricing Contact Get a demo EN Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing OK Odrzuć wszystkie Szczegóły zgód Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 1/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_1.txt", "chunk_index": 0, "file_size": 1452, "chunk_length": 1416}, "processed_at": "2025-08-27T16:14:43.537331"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Key Performance Indicators", "description": "Measurable values that demonstrate effectiveness in ecommerce.", "confidence": 0.95, "attributes": {"definition": "Regularly assessing your key performance indicators (KPI) is essential for meeting profit targets, remaining competitive, and growing your business."}, "source_chunk_id": "chunk_0"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online buying and selling.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_0"}, {"id": "data_source_1", "type": "DataSource", "name": "Customer Data Platform", "description": "System used to manage customer data for analytics.", "confidence": 0.85, "attributes": {"type": "Analytics Platform"}, "source_chunk_id": "chunk_0"}], "relationships": [{"id": "relationship_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPIs are essential for measuring success in the ecommerce domain.", "source_chunk_id": "chunk_0"}, {"id": "relationship_2", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "domain_1", "confidence": 0.85, "context": "Customer Data Platform is used within the ecommerce domain.", "source_chunk_id": "chunk_0"}]}
{"chunk_info": {"chunk_id": "chunk_1", "chunk_text": "traffic impressions cost per click cost per conversion number of leads Regularly monitoring and optimizing your KPIs helps make your business more successful and highlights areas that require improvement. Without KPIs, it is hard to know which strategies or processes are functioning and which are not. Properly contextualizing data is essential to understanding customer behavior. The abundance of data and analytics tools can quickly become overwhelming if you don’t set core sales funnel KPIs. Online businesses tend to use several tools to track different ecommerce KPIs. But to discover critical indicators and metrics, it’s best to set up analytics tracking for your ecommerce website if you haven’t done so already. Piwik PRO is a platform that lets you analyze the KPIs critical to your success. Business strategic thinking is crucial. You have to take into consideration different scenarios and funnel models. Segmentation is helpful, as it allows you to group customers, for example, according to their buying cycle. The KPI-based measurement model divides customer journeys into four stages: Key performance indicators (KPIs) measure the performance associated with key business goals, while metrics measure the progress associated with specific business tasks. Ecommerce KPIs and the marketing funnel There are many customer journeys There are many customer journeys A customer’s experience with a brand encompasses multiple touchpoints and channels, such as websites, ads, email, text messages, mobile apps, social media, call centers, and physical stores. You must analyze how customers find your website and interact with it. It is crucial to know how much time they spend on your website, the first things they see, the top pages they visit, and where the buying journey starts. Depending on the business, there might be many scenarios and customer journeys. It is vital to understand the complexity of customers’ journeys to provide a positive experience and grow your business. What’s more, the customer journey doesn’t end with the purchase. It includes how customers use your product, how often they return to buy it again, and if they recommend it to others. For more detailed insights into ecommerce analytics in Piwik PRO Analytics Suite, watch the full episode of our masterclass Ecommerce marketing: How to get enhanced online store analytics KPI-based measurement Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 4/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_4.txt", "chunk_index": 0, "file_size": 3166, "chunk_length": 3121}, "processed_at": "2025-08-27T16:14:56.499800"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Cost Per Click", "description": "The amount spent on advertising divided by the number of clicks received.", "confidence": 0.95, "attributes": {"definition": "Cost Per Click is a metric that measures the cost incurred for each click on an advertisement."}, "source_chunk_id": "chunk_1"}, {"id": "kpi_2", "type": "KPI", "name": "Cost Per Conversion", "description": "The total cost of acquiring a customer divided by the number of conversions.", "confidence": 0.95, "attributes": {"definition": "Cost Per Conversion measures the cost associated with converting a lead into a customer."}, "source_chunk_id": "chunk_1"}, {"id": "kpi_3", "type": "KPI", "name": "Number of Leads", "description": "The total number of potential customers who have shown interest in a product or service.", "confidence": 0.95, "attributes": {"definition": "Number of Leads refers to the count of individuals or businesses that have expressed interest in a company's offerings."}, "source_chunk_id": "chunk_1"}, {"id": "data_source_1", "type": "DataSource", "name": "Piwik PRO", "description": "A platform for analyzing key performance indicators critical to business success.", "confidence": 0.9, "attributes": {"type": "Analytics Platform"}, "source_chunk_id": "chunk_1"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "The business area focused on buying and selling goods and services online.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_1"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Cost Per Click is a key performance indicator in the ecommerce domain.", "source_chunk_id": "chunk_1"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Cost Per Conversion is a key performance indicator in the ecommerce domain.", "source_chunk_id": "chunk_1"}, {"id": "rel_3", "subject_id": "kpi_3", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Number of Leads is a key performance indicator in the ecommerce domain.", "source_chunk_id": "chunk_1"}, {"id": "rel_4", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "domain_1", "confidence": 0.9, "context": "Piwik PRO is used within the ecommerce domain for analytics.", "source_chunk_id": "chunk_1"}]}
{"chunk_info": {"chunk_id": "chunk_2", "chunk_text": "With the returning visitors metric, you can determine how many people have visited and returned to a website. You calculate it by dividing the number of repeat visitors by the total number of unique visitors to your site in a given time period. This valuable information can help assess if your website keeps an audience engaged and interested. For example, you can learn if visitors revisit the same product pages and then proceed directly to the shipping information. This knowledge allows you to improve the content of your product page by providing a link to the shipping information on the product page, reducing the time from consideration to purchase. This metric shows the ratio of cart additions to views of the product page. It is calculated by dividing the number of unique products added to a cart by the number of times they have been visited. This plays a crucial role in showcasing the success of your store’s products. It demonstrates how attractive your offer is to users, how you can provide a positive user experience, and how simple it is to add a product to the cart. And could indicate that a user wants to make a purchase. A high rate of cart-to-detail means that your store provides a pleasant and user-friendly experience for customers (on the level of product details). A low cart-to-detail rate suggests possible problems with content or pricing, which must be addressed. Monitoring the cart-to-detail ratio can assist in pinpointing potential areas for growth within your store and implementing necessary adjustments. To do it even more effectively, you can combine the cart-to-detail rate with the order-to-detail rate. In the case of a high cart-to-detail rate and a low order-to- detail rate for a given product, there may be an underlying issue in the sales funnel, potentially at the checkout stage. This KPI is also known as the abandoned cart percentage KPI or the abandonment rate. It measures the percentage of sessions that had an interaction with a cart but no order. Frequently, customers add items to their shopping cart but fail to complete the purchase. The average online shopping cart abandonment rate is 70.19%. A high abandonment rate can be caused by many factors, such as the unavailability of certain payment methods, high shipping charges, or simply the customer changing their mind about the purchase. Visitors can use site searches to find content on websites, such as product pages, product catalogs, articles, videos, and more. By analyzing site search usage, you can gain a better understanding of how visitors use your site’s search function, including the search terms they enter and the impact of the search results on engagement with your site. By focusing on this metric, you can significantly enhance your website’s traffic conversion and decrease the bounce rate. With the data, you can adjust your site search and provide a better user experience from the first few seconds of interaction. Neglecting your internal site search could lead to a poor user experience (UX) and ultimately depress your profits. 4. Cart-to-detail rate Providing customers with detailed product information, accurate descriptions, high-quality visuals, transparent return and shipping policies, and clear calls to action can lead to a high cart-to-detail rate. 5. Cart abandonment rate With the help of analytics, you can use your top “Exit pages” to pinpoint areas for improvement and identify drop-off points. 6. Site search usage Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 7/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_7.txt", "chunk_index": 0, "file_size": 4245, "chunk_length": 4204}, "processed_at": "2025-08-27T16:15:10.546079"}, "entities": [{"id": "1", "type": "KPI", "name": "Returning Visitors", "description": "Metric to determine how many people have visited and returned to a website.", "confidence": 0.95, "attributes": {"definition": "Calculated by dividing the number of repeat visitors by the total number of unique visitors in a given time period."}, "source_chunk_id": "chunk_2"}, {"id": "2", "type": "Metric", "name": "Cart-to-Detail Rate", "description": "Measures the ratio of cart additions to views of the product page.", "confidence": 0.95, "attributes": {"formula": "Number of unique products added to a cart / Number of times they have been visited"}, "source_chunk_id": "chunk_2"}, {"id": "3", "type": "KPI", "name": "Abandoned Cart Percentage", "description": "Measures the percentage of sessions that had an interaction with a cart but no order.", "confidence": 0.95, "attributes": {"definition": "Frequently, customers add items to their shopping cart but fail to complete the purchase."}, "source_chunk_id": "chunk_2"}, {"id": "4", "type": "Metric", "name": "Average Cart Abandonment Rate", "description": "Average rate of cart abandonment in online shopping.", "confidence": 0.9, "attributes": {"formula": "70.19%"}, "source_chunk_id": "chunk_2"}, {"id": "5", "type": "Metric", "name": "Site Search Usage", "description": "Analyzes how visitors use the site’s search function.", "confidence": 0.9, "attributes": {"definition": "Understanding search terms entered and their impact on engagement."}, "source_chunk_id": "chunk_2"}, {"id": "6", "type": "KPI", "name": "Cart Abandonment Rate", "description": "Indicates the rate at which customers abandon their shopping carts.", "confidence": 0.9, "attributes": {"definition": "High abandonment rate can be caused by various factors."}, "source_chunk_id": "chunk_2"}], "relationships": [{"id": "r1", "subject_id": "1", "predicate": "measures", "object_id": "2", "confidence": 0.9, "context": "Describes how returning visitors metric relates to cart-to-detail rate.", "source_chunk_id": "chunk_2"}, {"id": "r2", "subject_id": "3", "predicate": "hasDefinition", "object_id": "4", "confidence": 0.9, "context": "Defines abandoned cart percentage KPI.", "source_chunk_id": "chunk_2"}, {"id": "r3", "subject_id": "5", "predicate": "measures", "object_id": "6", "confidence": 0.9, "context": "Site search usage impacts cart abandonment rate.", "source_chunk_id": "chunk_2"}]}
{"chunk_info": {"chunk_id": "chunk_3", "chunk_text": "Stage by stage, consumers move through the sales funnel until they become repeat customers. Setting up an ecommerce funnel allows you to categorize clients and design efficient marketing strategies. A Key Performance Indicator (KPI) measures the success or performance of, for example, an advertising campaign. KPIs are set as targets. The following are some examples of KPIs in online marketing: Piwik PRO funnel reports: You may want to create a funnel that tracks events like app signups, button clicks, contact form submissions, or file downloads. Shopping behavior report in Piwik PRO: a funnel-based report that helps you analyze the customer journey from product discovery to purchase, spot drop-off points, and gives you a full view of how well your online store is doing. Read more about funnel and funnel reports in: Conversion funnel analysis: A step-by-step guide Funnel analysis What are ecommerce key performance indicators? Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 3/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_3.txt", "chunk_index": 0, "file_size": 1701, "chunk_length": 1670}, "processed_at": "2025-08-27T16:15:21.769269"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Advertising Campaign Success", "description": "Measures the success or performance of an advertising campaign.", "confidence": 0.95, "attributes": {"definition": "A Key Performance Indicator (KPI) that measures the success or performance of an advertising campaign."}, "source_chunk_id": "chunk_3"}, {"id": "kpi_2", "type": "KPI", "name": "Ecommerce Key Performance Indicators", "description": "KPIs specifically for ecommerce to measure performance.", "confidence": 0.9, "attributes": {"definition": "Metrics used to evaluate the performance of ecommerce activities."}, "source_chunk_id": "chunk_3"}, {"id": "table_1", "type": "Table", "name": "Piwik PRO Funnel Reports", "description": "Reports that track events in the ecommerce funnel.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_3"}, {"id": "table_2", "type": "Table", "name": "Shopping Behavior Report", "description": "A funnel-based report that analyzes customer journey.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_3"}, {"id": "domain_1", "type": "Domain", "name": "Online Marketing", "description": "Business area focused on marketing activities conducted online.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_3"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to online marketing", "source_chunk_id": "chunk_3"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Ecommerce KPIs related to online marketing", "source_chunk_id": "chunk_3"}, {"id": "rel_3", "subject_id": "table_1", "predicate": "contains", "object_id": "table_2", "confidence": 0.8, "context": "Piwik PRO Funnel Reports contain Shopping Behavior Report", "source_chunk_id": "chunk_3"}]}
{"chunk_info": {"chunk_id": "chunk_4", "chunk_text": "Explore the benefits of ecommerce analytics with Piwik PRO Analytics Suite Privacy compliance in ecommerce – a comprehensive guide Compare 7 free web analytics platforms (product analytics included) Ecommerce in transition – providing a safe customer experience Funnels based on behavioral segmentation: a little-known way to map the entire customer journey PRODUCT Analytics Tag Manager Consent Manager Customer Data Platform Pricing Integrations Changelog Privacy & security Professional services SOLUTIONS Analytics for web & mobile Analytics for product teams Tag management Data activation Privacy compliance HIPAA-compliant analytics Ecommerce analytics Server-side tracking & tagging SWITCH FROM Google Analytics Matomo AT Internet RESOURCES Blog Content library Webinars Success stories Glossary Help center Developers & API TOOLS Cookie Scanner URL Builder COMPANY Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 12/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_12.txt", "chunk_index": 0, "file_size": 1641, "chunk_length": 1606}, "processed_at": "2025-08-27T16:15:35.187509"}, "entities": [{"id": "1", "type": "KPI", "name": "Funnel Performance", "description": "Maximizing funnel performance in ecommerce.", "confidence": 0.95, "attributes": {"definition": "Funnel performance measures the effectiveness of the customer journey from awareness to conversion."}, "source_chunk_id": "chunk_4"}, {"id": "2", "type": "DataSource", "name": "Piwik PRO Analytics Suite", "description": "A comprehensive analytics suite for ecommerce.", "confidence": 0.9, "attributes": {"type": "Analytics Platform"}, "source_chunk_id": "chunk_4"}, {"id": "3", "type": "Domain", "name": "Ecommerce Analytics", "description": "Analytics focused on ecommerce performance and customer behavior.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_4"}, {"id": "4", "type": "Table", "name": "Customer Journey", "description": "Data structure representing the customer journey through the funnel.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_4"}, {"id": "5", "type": "Metric", "name": "Conversion Rate", "description": "Percentage of users who complete a desired action.", "confidence": 0.9, "attributes": {"formula": "Conversion Rate = (Conversions / Total Visitors) * 100"}, "source_chunk_id": "chunk_4"}], "relationships": [{"id": "1", "subject_id": "1", "predicate": "belongsTo", "object_id": "3", "confidence": 0.95, "context": "KPI related to ecommerce analytics", "source_chunk_id": "chunk_4"}, {"id": "2", "subject_id": "2", "predicate": "locatedIn", "object_id": "3", "confidence": 0.9, "context": "Data source for ecommerce analytics", "source_chunk_id": "chunk_4"}, {"id": "3", "subject_id": "4", "predicate": "contains", "object_id": "5", "confidence": 0.85, "context": "Table representing customer journey metrics", "source_chunk_id": "chunk_4"}]}
{"chunk_info": {"chunk_id": "chunk_5", "chunk_text": "This article explores the idea of an ecommerce funnel and provides insights on tracking the performance of an ecommerce online store through key performance metrics. Marketing funnels represent the various stages of customer journeys. They visually illustrate the steps your customers go through before making a purchase. Often, they also include post-purchase stages such as customer loyalty and advocacy. Table of contents 1. What is an ecommerce funnel? 2. What are ecommerce key performance indicators? 3. Ecommerce KPIs and the marketing funnel 4. KPI-based measurement 5. Ecommerce KPIs for the purchase/conversion stage 6. Choose the right analytics platform for your business 4.1. Ecommerce KPIs for the awareness/discovery stage 4.2. Ecommerce KPIs for the consideration stage 4.1.1. 1. Traffic source/medium 4.1.2. 2. Organic traffic sessions 4.1.3. 3. SEO keyword positions 4.1.4. 4. Click-through rate (CTR) 4.2.1. 1. Engagement rate 4.2.2. 2. Bounce rate 4.2.3. 3. Returning visitors 4.2.4. 4. Cart-to-detail rate 4.2.5. 5. Cart abandonment rate 4.2.6. 6. Site search usage 5.1. 5.2. Ecommerce KPIs for the post-purchase stage 5.1.1. 1. Orders new vs. returning 5.1.2. 2. Average order value by channel 5.1.3. 3. Revenue by product 5.1.4. 4. Revenue per visitor (RPV) 5.1.5. 5. Customer lifetime value (CLV) 5.2.1. 1. Average days between transactions 5.2.2. 2. Repeat purchase rate (RPR) 5.2.3. 3. Return on investment (ROI) What is an ecommerce funnel? Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 2/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_2.txt", "chunk_index": 0, "file_size": 2230, "chunk_length": 2199}, "processed_at": "2025-08-27T16:15:56.635746"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Customer Lifetime Value (CLV)", "description": "Total revenue a customer generates over their relationship with the company", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_2", "type": "KPI", "name": "Average Order Value by Channel", "description": "Average revenue generated per order across different channels", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_3", "type": "KPI", "name": "Revenue per Visitor (RPV)", "description": "Average revenue generated per visitor to the ecommerce site", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_4", "type": "KPI", "name": "Cart Abandonment Rate", "description": "Percentage of shopping carts that are abandoned before purchase", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_5", "type": "KPI", "name": "Repeat Purchase Rate (RPR)", "description": "Percentage of customers who make more than one purchase", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "table_1", "type": "Table", "name": "ecommerce_funnel", "description": "Table representing the stages of the ecommerce customer journey", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "metric_1", "type": "Metric", "name": "Conversion Rate", "description": "Percentage of visitors who complete a desired action", "confidence": 0.85, "attributes": {"formula": "Number of Conversions / Total Visitors * 100"}, "source_chunk_id": "chunk_5"}, {"id": "data_source_1", "type": "DataSource", "name": "Google Analytics", "description": "Web analytics service that tracks and reports website traffic", "confidence": 0.95, "attributes": {"type": "Analytics Platform"}, "source_chunk_id": "chunk_5"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online buying and selling", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_5"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "hasDefinition", "object_id": "kpi_1", "confidence": 0.95, "context": "Definition of Customer Lifetime Value", "source_chunk_id": "chunk_5"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "hasDefinition", "object_id": "kpi_2", "confidence": 0.9, "context": "Definition of Average Order Value by Channel", "source_chunk_id": "chunk_5"}, {"id": "rel_3", "subject_id": "kpi_3", "predicate": "hasDefinition", "object_id": "kpi_3", "confidence": 0.9, "context": "Definition of Revenue per Visitor", "source_chunk_id": "chunk_5"}, {"id": "rel_4", "subject_id": "kpi_4", "predicate": "hasDefinition", "object_id": "kpi_4", "confidence": 0.9, "context": "Definition of Cart Abandonment Rate", "source_chunk_id": "chunk_5"}, {"id": "rel_5", "subject_id": "kpi_5", "predicate": "hasDefinition", "object_id": "kpi_5", "confidence": 0.9, "context": "Definition of Repeat Purchase Rate", "source_chunk_id": "chunk_5"}, {"id": "rel_6", "subject_id": "table_1", "predicate": "contains", "object_id": "kpi_1", "confidence": 0.85, "context": "Ecommerce funnel table contains KPIs", "source_chunk_id": "chunk_5"}, {"id": "rel_7", "subject_id": "table_1", "predicate": "contains", "object_id": "kpi_2", "confidence": 0.85, "context": "Ecommerce funnel table contains KPIs", "source_chunk_id": "chunk_5"}, {"id": "rel_8", "subject_id": "table_1", "predicate": "contains", "object_id": "kpi_3", "confidence": 0.85, "context": "Ecommerce funnel table contains KPIs", "source_chunk_id": "chunk_5"}, {"id": "rel_9", "subject_id": "domain_1", "predicate": "contains", "object_id": "table_1", "confidence": 0.95, "context": "Ecommerce domain includes ecommerce funnel", "source_chunk_id": "chunk_5"}, {"id": "rel_10", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "domain_1", "confidence": 0.95, "context": "Google Analytics is used in the Ecommerce domain", "source_chunk_id": "chunk_5"}]}
