{"chunk_info": {"chunk_id": "chunk_0", "chunk_text": "Back to blog KPIs for ecommerce: Maximizing funnel performance ANALYTICS USE CASES Written by Aleksandra Szczepańska Published March 06, 2024 Regularly assessing your key performance indicators (KPI) is essential for meeting profit targets, remaining competitive, and growing your business. But which KPIs should be prioritized when measuring your ecommerce success? It all depends on your marketing funnel. The more customized your KPIs are to your marketing funnel, the more measurable and impactful they will be. Live webinar: Turn data into action with a FREE Customer Data Platform Product Solutions Resources Blog Pricing Contact Get a demo EN Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing OK Odrzuć wszystkie Szczegóły zgód Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 1/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_1.txt", "chunk_index": 0, "file_size": 1452, "chunk_length": 1416}, "processed_at": "2025-09-02T08:30:15.436824"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Key Performance Indicators", "description": "Measurable values that demonstrate effectiveness in ecommerce.", "confidence": 0.95, "attributes": {"definition": "Regularly assessing your key performance indicators (KPI) is essential for meeting profit targets, remaining competitive, and growing your business."}, "source_chunk_id": "chunk_0"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online buying and selling.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_0"}, {"id": "data_source_1", "type": "DataSource", "name": "Customer Data Platform", "description": "System used to manage customer data for analytics.", "confidence": 0.85, "attributes": {"type": "Product Solution"}, "source_chunk_id": "chunk_0"}], "relationships": [{"id": "relationship_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPIs are essential for measuring success in the ecommerce domain.", "source_chunk_id": "chunk_0"}, {"id": "relationship_2", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "domain_1", "confidence": 0.85, "context": "Customer Data Platform is used within the ecommerce domain.", "source_chunk_id": "chunk_0"}]}
{"chunk_info": {"chunk_id": "chunk_1", "chunk_text": "traffic impressions cost per click cost per conversion number of leads Regularly monitoring and optimizing your KPIs helps make your business more successful and highlights areas that require improvement. Without KPIs, it is hard to know which strategies or processes are functioning and which are not. Properly contextualizing data is essential to understanding customer behavior. The abundance of data and analytics tools can quickly become overwhelming if you don’t set core sales funnel KPIs. Online businesses tend to use several tools to track different ecommerce KPIs. But to discover critical indicators and metrics, it’s best to set up analytics tracking for your ecommerce website if you haven’t done so already. Piwik PRO is a platform that lets you analyze the KPIs critical to your success. Business strategic thinking is crucial. You have to take into consideration different scenarios and funnel models. Segmentation is helpful, as it allows you to group customers, for example, according to their buying cycle. The KPI-based measurement model divides customer journeys into four stages: Key performance indicators (KPIs) measure the performance associated with key business goals, while metrics measure the progress associated with specific business tasks. Ecommerce KPIs and the marketing funnel There are many customer journeys There are many customer journeys A customer’s experience with a brand encompasses multiple touchpoints and channels, such as websites, ads, email, text messages, mobile apps, social media, call centers, and physical stores. You must analyze how customers find your website and interact with it. It is crucial to know how much time they spend on your website, the first things they see, the top pages they visit, and where the buying journey starts. Depending on the business, there might be many scenarios and customer journeys. It is vital to understand the complexity of customers’ journeys to provide a positive experience and grow your business. What’s more, the customer journey doesn’t end with the purchase. It includes how customers use your product, how often they return to buy it again, and if they recommend it to others. For more detailed insights into ecommerce analytics in Piwik PRO Analytics Suite, watch the full episode of our masterclass Ecommerce marketing: How to get enhanced online store analytics KPI-based measurement Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 4/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_4.txt", "chunk_index": 0, "file_size": 3166, "chunk_length": 3121}, "processed_at": "2025-09-02T08:30:23.144340"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Cost per Click", "description": "The amount spent on advertising divided by the number of clicks received.", "confidence": 0.95, "attributes": {"definition": "Cost per Click is a metric that measures the cost incurred for each click on an advertisement."}, "source_chunk_id": "chunk_1"}, {"id": "kpi_2", "type": "KPI", "name": "Cost per Conversion", "description": "The total cost of acquiring a customer divided by the number of conversions.", "confidence": 0.95, "attributes": {"definition": "Cost per Conversion measures the cost associated with converting a lead into a customer."}, "source_chunk_id": "chunk_1"}, {"id": "kpi_3", "type": "KPI", "name": "Number of Leads", "description": "The total number of potential customers who have shown interest in a product or service.", "confidence": 0.95, "attributes": {"definition": "Number of Leads refers to the count of individuals or businesses that have expressed interest in a company's offerings."}, "source_chunk_id": "chunk_1"}, {"id": "data_source_1", "type": "DataSource", "name": "Piwik PRO", "description": "A platform for analyzing ecommerce KPIs.", "confidence": 0.9, "attributes": {"type": "Analytics Platform"}, "source_chunk_id": "chunk_1"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on buying and selling goods and services online.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_1"}], "relationships": [{"id": "relationship_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce performance", "source_chunk_id": "chunk_1"}, {"id": "relationship_2", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce performance", "source_chunk_id": "chunk_1"}, {"id": "relationship_3", "subject_id": "kpi_3", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce performance", "source_chunk_id": "chunk_1"}, {"id": "relationship_4", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "domain_1", "confidence": 0.85, "context": "Data source used for ecommerce analytics", "source_chunk_id": "chunk_1"}]}
{"chunk_info": {"chunk_id": "chunk_2", "chunk_text": "With the returning visitors metric, you can determine how many people have visited and returned to a website. You calculate it by dividing the number of repeat visitors by the total number of unique visitors to your site in a given time period. This valuable information can help assess if your website keeps an audience engaged and interested. For example, you can learn if visitors revisit the same product pages and then proceed directly to the shipping information. This knowledge allows you to improve the content of your product page by providing a link to the shipping information on the product page, reducing the time from consideration to purchase. This metric shows the ratio of cart additions to views of the product page. It is calculated by dividing the number of unique products added to a cart by the number of times they have been visited. This plays a crucial role in showcasing the success of your store’s products. It demonstrates how attractive your offer is to users, how you can provide a positive user experience, and how simple it is to add a product to the cart. And could indicate that a user wants to make a purchase. A high rate of cart-to-detail means that your store provides a pleasant and user-friendly experience for customers (on the level of product details). A low cart-to-detail rate suggests possible problems with content or pricing, which must be addressed. Monitoring the cart-to-detail ratio can assist in pinpointing potential areas for growth within your store and implementing necessary adjustments. To do it even more effectively, you can combine the cart-to-detail rate with the order-to-detail rate. In the case of a high cart-to-detail rate and a low order-to- detail rate for a given product, there may be an underlying issue in the sales funnel, potentially at the checkout stage. This KPI is also known as the abandoned cart percentage KPI or the abandonment rate. It measures the percentage of sessions that had an interaction with a cart but no order. Frequently, customers add items to their shopping cart but fail to complete the purchase. The average online shopping cart abandonment rate is 70.19%. A high abandonment rate can be caused by many factors, such as the unavailability of certain payment methods, high shipping charges, or simply the customer changing their mind about the purchase. Visitors can use site searches to find content on websites, such as product pages, product catalogs, articles, videos, and more. By analyzing site search usage, you can gain a better understanding of how visitors use your site’s search function, including the search terms they enter and the impact of the search results on engagement with your site. By focusing on this metric, you can significantly enhance your website’s traffic conversion and decrease the bounce rate. With the data, you can adjust your site search and provide a better user experience from the first few seconds of interaction. Neglecting your internal site search could lead to a poor user experience (UX) and ultimately depress your profits. 4. Cart-to-detail rate Providing customers with detailed product information, accurate descriptions, high-quality visuals, transparent return and shipping policies, and clear calls to action can lead to a high cart-to-detail rate. 5. Cart abandonment rate With the help of analytics, you can use your top “Exit pages” to pinpoint areas for improvement and identify drop-off points. 6. Site search usage Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 7/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_7.txt", "chunk_index": 0, "file_size": 4245, "chunk_length": 4204}, "processed_at": "2025-09-02T08:30:31.774308"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Returning Visitors", "description": "Metric that determines how many people have visited and returned to a website.", "confidence": 0.95, "attributes": {"definition": "Calculated by dividing the number of repeat visitors by the total number of unique visitors to your site in a given time period."}, "source_chunk_id": "chunk_2"}, {"id": "metric_1", "type": "Metric", "name": "Cart-to-Detail Rate", "description": "Shows the ratio of cart additions to views of the product page.", "confidence": 0.95, "attributes": {"formula": "Number of unique products added to a cart / Number of times they have been visited"}, "source_chunk_id": "chunk_2"}, {"id": "kpi_2", "type": "KPI", "name": "Cart Abandonment Rate", "description": "Measures the percentage of sessions that had an interaction with a cart but no order.", "confidence": 0.95, "attributes": {"definition": "Also known as the abandoned cart percentage KPI or the abandonment rate."}, "source_chunk_id": "chunk_2"}, {"id": "metric_2", "type": "Metric", "name": "Average Online Shopping Cart Abandonment Rate", "description": "Average rate at which customers abandon their shopping carts.", "confidence": 0.95, "attributes": {"formula": "70.19%"}, "source_chunk_id": "chunk_2"}, {"id": "metric_3", "type": "Metric", "name": "Site Search Usage", "description": "Analyzes how visitors use the site’s search function.", "confidence": 0.9, "attributes": {"definition": "Includes the search terms they enter and the impact of the search results on engagement."}, "source_chunk_id": "chunk_2"}, {"id": "kpi_3", "type": "KPI", "name": "Cart-to-Detail Rate Improvement", "description": "Improvement in the cart-to-detail rate through better product information and user experience.", "confidence": 0.9, "attributes": {"definition": "Providing detailed product information can lead to a high cart-to-detail rate."}, "source_chunk_id": "chunk_2"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "measures", "object_id": "metric_1", "confidence": 0.9, "context": "Describes how returning visitors can indicate engagement with the website.", "source_chunk_id": "chunk_2"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "measures", "object_id": "metric_2", "confidence": 0.9, "context": "Describes the relationship between cart abandonment and user behavior.", "source_chunk_id": "chunk_2"}, {"id": "rel_3", "subject_id": "metric_1", "predicate": "dependsOn", "object_id": "kpi_3", "confidence": 0.9, "context": "Improving the cart-to-detail rate can depend on the metrics analyzed.", "source_chunk_id": "chunk_2"}, {"id": "rel_4", "subject_id": "metric_3", "predicate": "measures", "object_id": "kpi_1", "confidence": 0.9, "context": "Site search usage can impact returning visitors.", "source_chunk_id": "chunk_2"}]}
{"chunk_info": {"chunk_id": "chunk_3", "chunk_text": "Stage by stage, consumers move through the sales funnel until they become repeat customers. Setting up an ecommerce funnel allows you to categorize clients and design efficient marketing strategies. A Key Performance Indicator (KPI) measures the success or performance of, for example, an advertising campaign. KPIs are set as targets. The following are some examples of KPIs in online marketing: Piwik PRO funnel reports: You may want to create a funnel that tracks events like app signups, button clicks, contact form submissions, or file downloads. Shopping behavior report in Piwik PRO: a funnel-based report that helps you analyze the customer journey from product discovery to purchase, spot drop-off points, and gives you a full view of how well your online store is doing. Read more about funnel and funnel reports in: Conversion funnel analysis: A step-by-step guide Funnel analysis What are ecommerce key performance indicators? Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 3/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_3.txt", "chunk_index": 0, "file_size": 1701, "chunk_length": 1670}, "processed_at": "2025-09-02T08:30:41.370926"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Advertising Campaign Success", "description": "Measures the success or performance of an advertising campaign.", "confidence": 0.95, "attributes": {"definition": "A Key Performance Indicator (KPI) that measures the success or performance of an advertising campaign."}, "source_chunk_id": "chunk_3"}, {"id": "kpi_2", "type": "KPI", "name": "Ecommerce Key Performance Indicators", "description": "Metrics used to evaluate the performance of ecommerce activities.", "confidence": 0.9, "attributes": {"definition": "KPIs that are specifically tailored for measuring ecommerce performance."}, "source_chunk_id": "chunk_3"}, {"id": "table_1", "type": "Table", "name": "Piwik PRO Funnel Reports", "description": "Reports that track events in the ecommerce funnel.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_3"}, {"id": "table_2", "type": "Table", "name": "Shopping Behavior Report", "description": "A funnel-based report that analyzes customer journey.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_3"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online sales and marketing.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_3"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce performance.", "source_chunk_id": "chunk_3"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPIs specifically for ecommerce.", "source_chunk_id": "chunk_3"}, {"id": "rel_3", "subject_id": "table_1", "predicate": "contains", "object_id": "table_2", "confidence": 0.8, "context": "Piwik PRO Funnel Reports contain various funnel tracking events.", "source_chunk_id": "chunk_3"}]}
{"chunk_info": {"chunk_id": "chunk_4", "chunk_text": "Explore the benefits of ecommerce analytics with Piwik PRO Analytics Suite Privacy compliance in ecommerce – a comprehensive guide Compare 7 free web analytics platforms (product analytics included) Ecommerce in transition – providing a safe customer experience Funnels based on behavioral segmentation: a little-known way to map the entire customer journey PRODUCT Analytics Tag Manager Consent Manager Customer Data Platform Pricing Integrations Changelog Privacy & security Professional services SOLUTIONS Analytics for web & mobile Analytics for product teams Tag management Data activation Privacy compliance HIPAA-compliant analytics Ecommerce analytics Server-side tracking & tagging SWITCH FROM Google Analytics Matomo AT Internet RESOURCES Blog Content library Webinars Success stories Glossary Help center Developers & API TOOLS Cookie Scanner URL Builder COMPANY Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 12/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_12.txt", "chunk_index": 0, "file_size": 1641, "chunk_length": 1606}, "processed_at": "2025-09-02T08:30:50.225694"}, "entities": [{"id": "1", "type": "Domain", "name": "Ecommerce Analytics", "description": "Analytics focused on ecommerce performance and customer behavior.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_4"}, {"id": "2", "type": "KPI", "name": "Funnel Performance", "description": null, "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_4"}, {"id": "4", "type": "Table", "name": "Customer Journey", "description": "Data structure representing the stages of customer interaction.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_4"}, {"id": "5", "type": "Metric", "name": "Conversion Rate", "description": null, "confidence": 0.8, "attributes": {}, "source_chunk_id": "chunk_4"}], "relationships": [{"id": "r1", "subject_id": "2", "predicate": "measures", "object_id": "5", "confidence": 0.9, "context": "KPIs for ecommerce", "source_chunk_id": "chunk_4"}, {"id": "r2", "subject_id": "3", "predicate": "contains", "object_id": "4", "confidence": 0.9, "context": "Data source for ecommerce analytics", "source_chunk_id": "chunk_4"}, {"id": "r3", "subject_id": "4", "predicate": "contains", "object_id": "6", "confidence": 0.85, "context": "Customer journey data structure", "source_chunk_id": "chunk_4"}, {"id": "r4", "subject_id": "4", "predicate": "contains", "object_id": "7", "confidence": 0.85, "context": "Customer journey data structure", "source_chunk_id": "chunk_4"}, {"id": "r5", "subject_id": "4", "predicate": "contains", "object_id": "8", "confidence": 0.85, "context": "Customer journey data structure", "source_chunk_id": "chunk_4"}, {"id": "r6", "subject_id": "1", "predicate": "hasDefinition", "object_id": "2", "confidence": 0.9, "context": "Ecommerce analytics KPIs", "source_chunk_id": "chunk_4"}]}
{"chunk_info": {"chunk_id": "chunk_5", "chunk_text": "This article explores the idea of an ecommerce funnel and provides insights on tracking the performance of an ecommerce online store through key performance metrics. Marketing funnels represent the various stages of customer journeys. They visually illustrate the steps your customers go through before making a purchase. Often, they also include post-purchase stages such as customer loyalty and advocacy. Table of contents 1. What is an ecommerce funnel? 2. What are ecommerce key performance indicators? 3. Ecommerce KPIs and the marketing funnel 4. KPI-based measurement 5. Ecommerce KPIs for the purchase/conversion stage 6. Choose the right analytics platform for your business 4.1. Ecommerce KPIs for the awareness/discovery stage 4.2. Ecommerce KPIs for the consideration stage 4.1.1. 1. Traffic source/medium 4.1.2. 2. Organic traffic sessions 4.1.3. 3. SEO keyword positions 4.1.4. 4. Click-through rate (CTR) 4.2.1. 1. Engagement rate 4.2.2. 2. Bounce rate 4.2.3. 3. Returning visitors 4.2.4. 4. Cart-to-detail rate 4.2.5. 5. Cart abandonment rate 4.2.6. 6. Site search usage 5.1. 5.2. Ecommerce KPIs for the post-purchase stage 5.1.1. 1. Orders new vs. returning 5.1.2. 2. Average order value by channel 5.1.3. 3. Revenue by product 5.1.4. 4. Revenue per visitor (RPV) 5.1.5. 5. Customer lifetime value (CLV) 5.2.1. 1. Average days between transactions 5.2.2. 2. Repeat purchase rate (RPR) 5.2.3. 3. Return on investment (ROI) What is an ecommerce funnel? Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 2/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_2.txt", "chunk_index": 0, "file_size": 2230, "chunk_length": 2199}, "processed_at": "2025-09-02T08:31:10.560427"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Customer Lifetime Value (CLV)", "description": "The total revenue a customer generates over their relationship with the company.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_2", "type": "KPI", "name": "Average Order Value by Channel", "description": "The average revenue generated per order across different channels.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_3", "type": "KPI", "name": "Revenue per Visitor (RPV)", "description": "The average revenue generated per visitor to the ecommerce site.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "kpi_4", "type": "KPI", "name": "Cart Abandonment Rate", "description": "The percentage of shopping carts that are abandoned before completing a purchase.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "table_1", "type": "Table", "name": "ecommerce_metrics", "description": "Table containing various ecommerce key performance indicators.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_5"}, {"id": "column_1", "type": "Column", "name": "traffic_source", "description": "Source of traffic to the ecommerce site.", "confidence": 0.85, "attributes": {"type": "string"}, "source_chunk_id": "chunk_5"}, {"id": "column_2", "type": "Column", "name": "organic_traffic_sessions", "description": "Number of sessions generated from organic traffic.", "confidence": 0.85, "attributes": {"type": "integer"}, "source_chunk_id": "chunk_5"}, {"id": "column_3", "type": "Column", "name": "click_through_rate", "description": "Rate at which users click on a link compared to the number of times it is shown.", "confidence": 0.85, "attributes": {"type": "decimal"}, "source_chunk_id": "chunk_5"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online retail and sales.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_5"}], "relationships": [{"id": "relationship_1", "subject_id": "kpi_1", "predicate": "hasDefinition", "object_id": "kpi_1", "confidence": 0.95, "context": "Definition of Customer Lifetime Value", "source_chunk_id": "chunk_5"}, {"id": "relationship_2", "subject_id": "kpi_2", "predicate": "hasDefinition", "object_id": "kpi_2", "confidence": 0.9, "context": "Definition of Average Order Value by Channel", "source_chunk_id": "chunk_5"}, {"id": "relationship_3", "subject_id": "kpi_3", "predicate": "hasDefinition", "object_id": "kpi_3", "confidence": 0.9, "context": "Definition of Revenue per Visitor", "source_chunk_id": "chunk_5"}, {"id": "relationship_4", "subject_id": "kpi_4", "predicate": "hasDefinition", "object_id": "kpi_4", "confidence": 0.9, "context": "Definition of Cart Abandonment Rate", "source_chunk_id": "chunk_5"}, {"id": "relationship_5", "subject_id": "table_1", "predicate": "contains", "object_id": "column_1", "confidence": 0.85, "context": "Ecommerce metrics table contains traffic source column", "source_chunk_id": "chunk_5"}, {"id": "relationship_6", "subject_id": "table_1", "predicate": "contains", "object_id": "column_2", "confidence": 0.85, "context": "Ecommerce metrics table contains organic traffic sessions column", "source_chunk_id": "chunk_5"}, {"id": "relationship_7", "subject_id": "table_1", "predicate": "contains", "object_id": "column_3", "confidence": 0.85, "context": "Ecommerce metrics table contains click-through rate column", "source_chunk_id": "chunk_5"}, {"id": "relationship_8", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "Customer Lifetime Value belongs to Ecommerce domain", "source_chunk_id": "chunk_5"}, {"id": "relationship_9", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Average Order Value by Channel belongs to Ecommerce domain", "source_chunk_id": "chunk_5"}, {"id": "relationship_10", "subject_id": "kpi_3", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Revenue per Visitor belongs to Ecommerce domain", "source_chunk_id": "chunk_5"}, {"id": "relationship_11", "subject_id": "kpi_4", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "Cart Abandonment Rate belongs to Ecommerce domain", "source_chunk_id": "chunk_5"}]}
{"chunk_info": {"chunk_id": "chunk_6", "chunk_text": "To convert more visitors into buyers, consider keeping track of the following metrics: When analyzing orders by new vs. returning customers, we look at the number of orders from new customers compared to returning customers over a given period. When you analyze and compare data on orders by new vs returning customers, you can identify trends, patterns, and areas for improvement. For example, many repeat customers suggest that the company maintains a loyal clientele, a vital factor in sustained growth and financial success. Keeping customers is often more cost-effective than attracting new ones, as repeat customers are more inclined to make future purchases and recommend the brand to others. The average order value (AOV) is the average value of each order placed through a specific channel over a set period. This metric is calculated by dividing the revenue by the number of orders. It allows you to see which traffic channels generate the most revenue and consequently justify allocating a larger budget. You can analyze the revenue generated through different sales channels, such as marketplaces like Amazon, social media, email marketing, and your online ecommerce store. Tracking also helps you analyze customer buying patterns and return on investment (ROI) from advertising spend, thus improving your profitability. For instance, if people spend significantly less than the product’s price, it could indicate heavy use of discounts, so you may need to reduce them. Revenue by product is the percentage of total revenue generated by a particular product. It helps you identify the products with the highest sales, demonstrating their value and importance to the company. It will also help you identify which products are not generating enough revenue. Intent plays an important role in the consideration stage. Intent plays an important role in the consideration stage. To discover your customer’s intent, you might use interviews run, for example, via customer support chat to gain a powerful source of insights. You may ask your customers where their journey has started, how they arrived at the website, or about factors they have in mind before purchasing – for example, what other products they consider. Ecommerce KPIs for the purchase/conversion stage 1. Orders new vs. returning Tracking the ratio of orders from new and returning customers is essential to gauge the success of marketing efforts and loyalty programs. Returning customers often show their satisfaction and loyalty to the brand, while a large number of new customers can indicate effective acquisition strategies. 2. Average order value by channel Each channel offers various combinations of audience reach, content, or performance. It’s important to carefully consider which channels or combination of channels will provide the best returns. 3. Revenue by product Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 8/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_8.txt", "chunk_index": 0, "file_size": 3624, "chunk_length": 3585}, "processed_at": "2025-09-02T08:31:25.200926"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Orders New vs. Returning", "description": "Tracking the ratio of orders from new and returning customers to gauge marketing success.", "confidence": 0.95, "attributes": {"definition": "Essential to gauge the success of marketing efforts and loyalty programs."}, "source_chunk_id": "chunk_6"}, {"id": "kpi_2", "type": "KPI", "name": "Average Order Value (AOV)", "description": "The average value of each order placed through a specific channel over a set period.", "confidence": 0.95, "attributes": {"definition": "Calculated by dividing the revenue by the number of orders."}, "source_chunk_id": "chunk_6"}, {"id": "kpi_3", "type": "KPI", "name": "Revenue by Product", "description": "The percentage of total revenue generated by a particular product.", "confidence": 0.95, "attributes": {"definition": "Helps identify products with the highest sales and their importance to the company."}, "source_chunk_id": "chunk_6"}, {"id": "metric_1", "type": "Metric", "name": "Average Order Value Calculation", "description": "A metric that shows the average revenue per order.", "confidence": 0.9, "attributes": {"formula": "Revenue / Number of Orders"}, "source_chunk_id": "chunk_6"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online buying and selling.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_6"}, {"id": "data_source_1", "type": "DataSource", "name": "Customer Support Chat", "description": "Source of insights into customer intent and behavior.", "confidence": 0.9, "attributes": {"type": "Communication Tool"}, "source_chunk_id": "chunk_6"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "hasDefinition", "object_id": "kpi_1", "confidence": 0.95, "context": "Definition of KPI", "source_chunk_id": "chunk_6"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "hasDefinition", "object_id": "kpi_2", "confidence": 0.95, "context": "Definition of KPI", "source_chunk_id": "chunk_6"}, {"id": "rel_3", "subject_id": "kpi_3", "predicate": "hasDefinition", "object_id": "kpi_3", "confidence": 0.95, "context": "Definition of KPI", "source_chunk_id": "chunk_6"}, {"id": "rel_4", "subject_id": "metric_1", "predicate": "calculatedBy", "object_id": "metric_1", "confidence": 0.9, "context": "Calculation of Average Order Value", "source_chunk_id": "chunk_6"}, {"id": "rel_5", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "KPI belongs to Ecommerce domain", "source_chunk_id": "chunk_6"}, {"id": "rel_6", "subject_id": "data_source_1", "predicate": "locatedIn", "object_id": "data_source_1", "confidence": 0.9, "context": "Source of customer insights", "source_chunk_id": "chunk_6"}]}
{"chunk_info": {"chunk_id": "chunk_7", "chunk_text": "Awareness/discovery Consideration Purchase/conversion Post-purchase Marketers should establish performance indicators for every step of the funnel and evaluate success of their activities based on these metrics. Now, let’s talk about how to track the top KPIs for ecommerce at every stage of the marketing funnel. Your marketing efforts should be focused on brand awareness and product demand at this stage. The awareness/discovery stage is where users are just getting to know the brand and what it offers. Consider KPIs that indicate where your new visitors come from, how many visit your site, and whether they are eager to engage. Your top KPIs can include the following: The source refers to the starting point of your website’s visitors, such as a search engine (for example, Google) or a specific domain. The medium specifies the source type, like organic search (organic) or cost-per-click paid search (CPC). This KPI is crucial as it allows for customized customer experiences, such as aligning content and guiding users to the next stage of your funnel based on how they find and interact with your website. The most important indicator is the number of visitors/sessions incoming from a specific source/medium since this gives you insight into, for example, whether visitors are coming from channels you’re investing money into. By monitoring this metric, you can assess your website’s search engine effectiveness, trustworthiness, and influence. It provides insight into the number of visitors discovering your site through search engines, which is crucial for those relying heavily on inbound traffic from search results (SEO). This KPI provides valuable insight into user behavior by tracking the number of website visitors who found your link through a search engine result page rather than through paid ads. You can increase the number of visits from search engines by improving your content’s ranking in relevant search results with SEO. The main goal of your content should be to entice visitors with a clear intent and use. Ecommerce KPIs for the awareness/discovery stage 1. Traffic source/medium Channels in Piwik PRO provide insights into the various sources and channels that drive traffic to your online store. 2. Organic traffic sessions Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 5/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_5.txt", "chunk_index": 0, "file_size": 3035, "chunk_length": 2994}, "processed_at": "2025-09-02T08:31:32.368494"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Traffic Source/Medium", "description": "Indicates the starting point of website visitors, such as a search engine or specific domain.", "confidence": 0.95, "attributes": {"definition": "The source refers to the starting point of your website’s visitors, such as a search engine (for example, Google) or a specific domain."}, "source_chunk_id": "chunk_7"}, {"id": "kpi_2", "type": "KPI", "name": "Organic Traffic Sessions", "description": "Measures the number of sessions initiated by visitors coming from organic search results.", "confidence": 0.95, "attributes": {"definition": "This KPI provides valuable insight into user behavior by tracking the number of website visitors who found your link through a search engine result page rather than through paid ads."}, "source_chunk_id": "chunk_7"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce", "description": "Business area focused on online buying and selling of goods.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_7"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce marketing funnel", "source_chunk_id": "chunk_7"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.9, "context": "KPI related to ecommerce marketing funnel", "source_chunk_id": "chunk_7"}]}
{"chunk_info": {"chunk_id": "chunk_8", "chunk_text": "About Clients Careers Partners Media Contact Piwik PRO vs. GA Universal & GA4 Piwik PRO vs. GA3 360 & GA4 360 Piwik PRO vs. Matomo Piwik PRO vs. Adobe Analytics Piwik PRO vs. GA3 & GA4 (table) Piwik PRO vs. Matomo (table) Piwik PRO vs. Adobe Analytics (table) Piwik PRO vs. AT Internet (table) Piwik PRO vs. Countly (table) Piwik PRO vs. Amplitude (table) Piwik PRO vs. Mixpanel (table) Piwik PRO vs. Snowplow (table) Piwik PRO vs. Heap (table) PP Tag Manager vs. GTM (table) Web analytics comparison Tag manager comparison CDP vendor comparison Consent management comparison Free web analytics platforms comparison Core vs. Enterprise 6 ways analytics software collects data 17 new privacy laws around the world Is GA GDPR-compliant? Is GA HIPAA-compliant? A review of HIPAA-compliant analytics platforms © 2025 Piwik PRO Take control of your data Privacy policy ∙Service Level Agreement ∙Sitemap ∙Bug bounty program Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 13/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_13.txt", "chunk_index": 0, "file_size": 1688, "chunk_length": 1650}, "processed_at": "2025-09-02T08:31:49.364297"}, "entities": [{"id": "entity_1", "type": "Table", "name": "Piwik PRO vs. GA3 & GA4", "description": "Comparison table between Piwik PRO and Google Analytics versions.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_2", "type": "Table", "name": "Piwik PRO vs. Matomo", "description": "Comparison table between Piwik PRO and Matomo.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_3", "type": "Table", "name": "Piwik PRO vs. Adobe Analytics", "description": "Comparison table between Piwik PRO and Adobe Analytics.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_4", "type": "Table", "name": "Piwik PRO vs. AT Internet", "description": "Comparison table between Piwik PRO and AT Internet.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_5", "type": "Table", "name": "Piwik PRO vs. Countly", "description": "Comparison table between Piwik PRO and Countly.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_6", "type": "Table", "name": "Piwik PRO vs. Amplitude", "description": "Comparison table between Piwik PRO and Amplitude.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_7", "type": "Table", "name": "Piwik PRO vs. Mixpanel", "description": "Comparison table between Piwik PRO and Mixpanel.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_8", "type": "Table", "name": "Piwik PRO vs. Snowplow", "description": "Comparison table between Piwik PRO and Snowplow.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_9", "type": "Table", "name": "Piwik PRO vs. Heap", "description": "Comparison table between Piwik PRO and Heap.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_10", "type": "Table", "name": "PP Tag Manager vs. GTM", "description": "Comparison table between PP Tag Manager and Google Tag Manager.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_11", "type": "Domain", "name": "Web Analytics", "description": "Domain related to web analytics tools and comparisons.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_12", "type": "Domain", "name": "Tag Management", "description": "Domain related to tag management systems.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_13", "type": "Domain", "name": "Customer Data Platforms", "description": "Domain related to customer data platform vendors.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_14", "type": "Domain", "name": "Consent Management", "description": "Domain related to consent management practices.", "confidence": 0.9, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_15", "type": "KPI", "name": "Conversion Tracking", "description": "KPI related to tracking conversions in analytics.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_8"}, {"id": "entity_16", "type": "KPI", "name": "Remarketing", "description": "KPI related to remarketing efforts in analytics.", "confidence": 0.85, "attributes": {}, "source_chunk_id": "chunk_8"}], "relationships": [{"id": "relationship_1", "subject_id": "entity_1", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_2", "subject_id": "entity_2", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_3", "subject_id": "entity_3", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_4", "subject_id": "entity_4", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_5", "subject_id": "entity_5", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_6", "subject_id": "entity_6", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_7", "subject_id": "entity_7", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_8", "subject_id": "entity_8", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_9", "subject_id": "entity_9", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.9, "context": "Comparison of analytics tools", "source_chunk_id": "chunk_8"}, {"id": "relationship_10", "subject_id": "entity_10", "predicate": "belongsTo", "object_id": "entity_12", "confidence": 0.9, "context": "Comparison of tag management systems", "source_chunk_id": "chunk_8"}, {"id": "relationship_11", "subject_id": "entity_15", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.85, "context": "KPI related to web analytics", "source_chunk_id": "chunk_8"}, {"id": "relationship_12", "subject_id": "entity_16", "predicate": "belongsTo", "object_id": "entity_11", "confidence": 0.85, "context": "KPI related to web analytics", "source_chunk_id": "chunk_8"}]}
{"chunk_info": {"chunk_id": "chunk_9", "chunk_text": "Keyword performance or ranking refers to tracking the topics and search terms on your website that attract the most traffic. With this KPI, you get different keyword positions and search volume. It’s important because it helps you understand the most relevant and high-impact keywords. This guides your optimization efforts and helps you determine how well your site is positioned for those crucial keywords. If you want to maintain a strong presence in search engine results, it’s vital to regularly check and optimize your top keywords and pages using keyword data to improve your content. Ranking higher means more visibility, more qualified buyers, and more revenue. The click-through rate is a metric that measures the number of users who clicked a link, call-to-action button, or ad in comparison to the number of impressions it received. You can determine whether your content and marketing campaigns are reaching your target audience by measuring CTR. It can also help assess how different marketing channels affect a business’s performance. We can identify areas for improving our customer acquisition strategy by analyzing the click-through rate. To improve CTR, you can use strategies like optimizing your headline (use keywords), using appealing images, and direct and compelling call to actions (CTAs). In the consideration stage, your brand must actively engage with potential and existing customers. The essential KPIs should include metrics connected to sessions and returning visitors. At this stage, you may observe patterns to perform tests and experiments to improve the user experience. The data from the consideration phase helps you learn about people’s behavior and the time it takes them to make a purchase. All the data from this stage can assist you in making the user experience smoother, eventually leading to higher sales. The engagement rate is a KPI that evaluates the level of engagement with a product or content. A high engagement rate can result in more clicks and conversions, showing that users are actively interacting and, thus, more likely to convert. To boost engagement, it is crucial to provide users with a seamless navigation experience across your website or app during their interactions and simplify your demo or transactional forms. The bounce rate is the percentage of people who enter a single page and leave it without taking any further action. It is calculated by dividing single-page sessions by all sessions. You can use the bounce rate to measure the success of a single landing page. A high bounce rate indicates that the landing page needs to be improved. Using this metric, you can determine whether the visitor’s search intent was met. Also, it can indicate whether landing pages match the expectations created by ad campaigns. To reduce your website’s bounce rate, you can improve your site speed, optimize it for mobile users, and make your content more engaging. 3. SEO keyword positions 4. Click-through rate (CTR) Ecommerce KPIs for the consideration stage 1. Engagement rate High engagement but low conversions indicate that the content is engaging but isn’t driving users to purchase or that it’s not reaching the right audience. 2. Bounce rate 3. Returning visitors Powered by Ustawienia prywatności Nasza strona internetowa chroni Twoją prywatność, przestrzegając unijnego Ogólnego rozporządzenia o ochronie danych (RODO). Nie będziemy wykorzystywać Twoich danych w żadnym celu, na który nie wyrażasz zgody i będziemy przetwarzać Twoje dane tylko w zakresie, w jakim nie przekracza to danych, które są niezbędne do realizacji określonych celów przetwarzania. Możesz wyrazić zgodę(y) na przetwarzanie Twoich danych w określonych celach poniżej lub klikając „Wyrażam zgodę\". Analityka Śledzenie konwersji Remarketing Polityka prywatności Polski 10.02.2025, 10:04 KPIs for ecommerce: Maximizing funnel performance - Piwik PRO https://piwik.pro/blog/kpis-ecommerce-maximizing-funnel-performance/ 6/13", "chunk_metadata": {"document_name": "piwik_texts", "source_file": "sources/extracted_texts/piwik_texts/piwik_page_6.txt", "chunk_index": 0, "file_size": 4014, "chunk_length": 3967}, "processed_at": "2025-09-02T08:32:00.544008"}, "entities": [{"id": "kpi_1", "type": "KPI", "name": "Keyword Performance", "description": "Tracking the topics and search terms on your website that attract the most traffic.", "confidence": 0.95, "attributes": {"definition": "Helps understand the most relevant and high-impact keywords."}, "source_chunk_id": "chunk_9"}, {"id": "kpi_2", "type": "KPI", "name": "Click-Through Rate (CTR)", "description": "Measures the number of users who clicked a link compared to the number of impressions.", "confidence": 0.95, "attributes": {"definition": "Indicates how well content and marketing campaigns reach the target audience."}, "source_chunk_id": "chunk_9"}, {"id": "kpi_3", "type": "KPI", "name": "Engagement Rate", "description": "Evaluates the level of engagement with a product or content.", "confidence": 0.95, "attributes": {"definition": "A high engagement rate can lead to more clicks and conversions."}, "source_chunk_id": "chunk_9"}, {"id": "kpi_4", "type": "KPI", "name": "Bounce Rate", "description": "Percentage of people who enter a single page and leave without further action.", "confidence": 0.95, "attributes": {"definition": "Indicates the success of a single landing page."}, "source_chunk_id": "chunk_9"}, {"id": "metric_1", "type": "Metric", "name": "Bounce Rate Calculation", "description": "Calculated measure of bounce rate.", "confidence": 0.9, "attributes": {"formula": "Bounce Rate = Single-Page Sessions / All Sessions"}, "source_chunk_id": "chunk_9"}, {"id": "domain_1", "type": "Domain", "name": "Ecommerce KPIs", "description": "Business area focusing on key performance indicators for ecommerce.", "confidence": 0.95, "attributes": {}, "source_chunk_id": "chunk_9"}], "relationships": [{"id": "rel_1", "subject_id": "kpi_1", "predicate": "hasDefinition", "object_id": "kpi_1", "confidence": 0.95, "context": "Definition of Keyword Performance", "source_chunk_id": "chunk_9"}, {"id": "rel_2", "subject_id": "kpi_2", "predicate": "hasDefinition", "object_id": "kpi_2", "confidence": 0.95, "context": "Definition of Click-Through Rate", "source_chunk_id": "chunk_9"}, {"id": "rel_3", "subject_id": "kpi_3", "predicate": "hasDefinition", "object_id": "kpi_3", "confidence": 0.95, "context": "Definition of Engagement Rate", "source_chunk_id": "chunk_9"}, {"id": "rel_4", "subject_id": "kpi_4", "predicate": "hasDefinition", "object_id": "kpi_4", "confidence": 0.95, "context": "Definition of Bounce Rate", "source_chunk_id": "chunk_9"}, {"id": "rel_5", "subject_id": "metric_1", "predicate": "calculatedBy", "object_id": "metric_1", "confidence": 0.9, "context": "Calculation method for Bounce Rate", "source_chunk_id": "chunk_9"}, {"id": "rel_6", "subject_id": "kpi_1", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "Keyword Performance belongs to Ecommerce KPIs", "source_chunk_id": "chunk_9"}, {"id": "rel_7", "subject_id": "kpi_2", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "Click-Through Rate belongs to Ecommerce KPIs", "source_chunk_id": "chunk_9"}, {"id": "rel_8", "subject_id": "kpi_3", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "Engagement Rate belongs to Ecommerce KPIs", "source_chunk_id": "chunk_9"}, {"id": "rel_9", "subject_id": "kpi_4", "predicate": "belongsTo", "object_id": "domain_1", "confidence": 0.95, "context": "Bounce Rate belongs to Ecommerce KPIs", "source_chunk_id": "chunk_9"}]}
